In [1]:
import pandas as pd
import numpy as np

from classes.KAnonymizer import KAnonymizer

In [2]:
ds = pd.read_csv(filepath_or_buffer='Artists-Pseudo-02.csv',sep=',')
ds

,Unnamed: 0,ConstituentID,DisplayName,Region,Gender,BeginDate,Wiki QID,Income ($)
0,0,1,Robert Arneson,Port Vila; Vanuatu; Melanesia; Oceania,Male,1930,Q6113656,20900
1,1,2,Doroteo Arnaiz,Fort-de-France; Martinique; Caribbean; Americas,Male,1936,Q164351,9300
2,2,3,Bill Arnold,Sanaa; Yemen; Western Asia; Asia,Male,1941,Q6668231,5400
3,3,4,Charles Arnoldi,Lome; Togo; Western Africa; Africa,Male,1946,Q1063584,11600
4,4,5,Per Arnoldi,Luanda; Angola; Middle Africa; Africa,Male,1941,Q663175,9300
...,...,...,...,...,...,...,...,...
15710,15710,132165,Eric Klarenbeek,Kuala Lumpur; Malaysia; South-Eastern Asia; Asia,Male,1978,Q1471465,9300
15711,15711,132166,Maartje Dros,The Valley; Anguilla; Caribbean; Americas,Female,1862,Q259594,9300
15712,15712,132170,The Event Horizon Telescope Collaboration,Maseru; Lesotho; Southern Africa; Africa,male,1791,Q182014,34400
15713,15713,132427,Krasnyi proletarii,Accra; Ghana; Western Africa; Africa,Female,1821,Q380494,12400
15714,15714,132545,Ann Tyng,Lusaka; Zambia; Eastern Africa; Africa,Female,1920,Q21071066,5400

In [3]:
sensitivity_features = [i  for i in ds.columns if i not in ['Region','BeginDate','Income ($)']] 
sensitivity_features

['Unnamed: 0', 'ConstituentID', 'DisplayName', 'Gender', 'Wiki QID']

In [4]:
ano = KAnonymizer(ds,sensitivity_features=sensitivity_features)

In [5]:
ano.getAnonymizedData()

,Income ($),city,country,sub-region,region,year,decade,century
0,20900,Port Vila,Vanuatu,Melanesia,Oceania,1930,1920,20
1,9300,Fort-de-France,Martinique,Caribbean,Americas,1936,1930,20
2,5400,Sanaa,Yemen,Western Asia,Asia,1941,1940,20
3,11600,Lome,Togo,Western Africa,Africa,1946,1940,20
4,9300,Luanda,Angola,Middle Africa,Africa,1941,1940,20
...,...,...,...,...,...,...,...,...
15710,9300,Kuala Lumpur,Malaysia,South-Eastern Asia,Asia,1978,1970,20
15711,9300,The Valley,Anguilla,Caribbean,Americas,1862,1860,19
15712,34400,Maseru,Lesotho,Southern Africa,Africa,1791,1790,18
15713,12400,Accra,Ghana,Western Africa,Africa,1821,1820,19
15714,5400,Lusaka,Zambia,Eastern Africa,Africa,1920,1910,20

In [6]:
a = ano.getAnonymizedData().groupby('Income ($)')
# b = ano.getAnonymizedData().groupby('Income ($)')['sub-region'].value_counts()
# c = ano.getAnonymizedData().groupby('Income ($)')['country'].value_counts()
# d = ano.getAnonymizedData().groupby('Income ($)')['city'].value_counts()

# a = pd.DataFrame(a)

In [7]:
a

In [8]:
datasets = []
for x,y in a:
    df = pd.DataFrame(y)
    datasets.append(df)
    print(y)

       Income ($)      city        country         sub-region     region  \
12           3100     Minsk        Belarus     Eastern Europe     Europe
61           3100    Astana     Kazakhstan       Central Asia       Asia
71           3100     Amman         Jordan       Western Asia       Asia
85           3100  Damascus          Syria       Western Asia       Asia
111          3100      Nuuk      Greenland   Northern America   Americas
...           ...       ...            ...                ...        ...
15504        3100      Riga         Latvia    Northern Europe     Europe
15511        3100   Managua      Nicaragua    Central America   Americas
15556        3100     Dhaka     Bangladesh      Southern Asia       Asia
15610        3100   Nicosia         Cyprus    Southern Europe     Europe
15687        3100      Suva   Fiji Islands          Melanesia    Oceania

       year  decade  century
12     1907    1900       20
61     1916    1910       20
71     1945    1940       20
85     1899    1890       19
111    1926    1920       20
...     ...     ...      ...
15504  1858    1850       19
15511  1946    1940       20
15556  1962    1960       20
15610  1858    1850       19
15687  1978    1970       20

[496 rows x 8 columns]
       Income ($)        city      country        sub-region     region  year  \
2            5400       Sanaa        Yemen      Western Asia       Asia  1941
25           5400  Bratislava     Slovakia    Eastern Europe     Europe  1941
28           5400  Nouakchott   Mauritania    Western Africa     Africa  1898
34           5400  San Marino   San Marino   Southern Europe     Europe  1888
119          5400   Stockholm       Sweden   Northern Europe     Europe  1858
...           ...         ...          ...               ...        ...   ...
15645        5400   Reykjavik      Iceland   Northern Europe     Europe  1810
15648        5400      Roseau     Dominica         Caribbean   Americas  1932
15672        5400     Nicosia       Cyprus   Southern Europe     Europe  1902
15701        5400  Libreville        Gabon     Middle Africa     Africa  1925
15714        5400      Lusaka       Zambia    Eastern Africa     Africa  1920

       decade  century
2        1940       20
25       1940       20
28       1890       19
34       1880       19
119      1850       19
...       ...      ...
15645    1800       19
15648    1930       20
15672    1900       20
15701    1920       20
15714    1910       20

[941 rows x 8 columns]
       Income ($)                 city         country           sub-region  \
10           6500               Astana      Kazakhstan         Central Asia
13           6500                 Male        Maldives        Southern Asia
74           6500                Vaduz   Liechtenstein       Western Europe
77           6500  Bandar Seri Begawan          Brunei   South-Eastern Asia
78           6500                Sanaa           Yemen         Western Asia
...           ...                  ...             ...                  ...
15620        6500         Antananarivo      Madagascar       Eastern Africa
15621        6500              Thimphu          Bhutan        Southern Asia
15671        6500               Riyadh    Saudi Arabia         Western Asia
15694        6500              Nairobi           Kenya       Eastern Africa
15706        6500             San Juan     Puerto Rico            Caribbean

          region  year  decade  century
10          Asia  1936    1930       20
13          Asia  1900    1890       19
74        Europe  1937    1930       20
77          Asia  1901    1900       20
78          Asia  1908    1900       20
...          ...   ...     ...      ...
15620     Africa  1970    1960       20
15621       Asia  1950    1940       20
15671       Asia  1938    1930       20
15694     Africa  1972    1970       20
15706   Americas  1858    1850       19

[1197 rows x 8 columns]
       Income ($)        city         country           sub-region     region  \
11           9000        Dili      East Timor   South-Eastern Asia       Asia
40           9000       Macao    Macau S.A.R.         Eastern Asia       Asia
45           9000  Ulan Bator        Mongolia         Eastern Asia       Asia
92           9000        Suva    Fiji Islands            Melanesia    Oceania
101          9000     Cayenne   French Guiana        South America   Americas
...           ...         ...             ...                  ...        ...
15624        9000     Colombo       Sri Lanka        Southern Asia       Asia
15631        9000     Algiers         Algeria      Northern Africa     Africa
15649        9000     Yerevan         Armenia         Western Asia       Asia
15688        9000  Luxembourg      Luxembourg       Western Europe     Europe
15690        9000    Gaborone        Botswana      Southern Africa     Africa

       year  decade  century
11     1911    1910       20
40     1933    1930       20
45     1940    1930       20
92     1910    1900       20
101    1890    1880       19
...     ...     ...      ...
15624  1929    1920       20
15631  1914    1910       20
15649  2003    2000       21
15688  1922    1920       20
15690  1923    1920       20

[1774 rows x 8 columns]
       Income ($)            city      country           sub-region  \
1            9300  Fort-de-France   Martinique            Caribbean
4            9300          Luanda       Angola        Middle Africa
8            9300        Chisinau      Moldova       Eastern Europe
14           9300          Taipei       Taiwan         Eastern Asia
15           9300         Baghdad         Iraq         Western Asia
...           ...             ...          ...                  ...
15685        9300      Copenhagen      Denmark      Northern Europe
15689        9300          Astana   Kazakhstan         Central Asia
15698        9300        Singapur    Singapore   South-Eastern Asia
15710        9300    Kuala Lumpur     Malaysia   South-Eastern Asia
15711        9300      The Valley     Anguilla            Caribbean

          region  year  decade  century
1       Americas  1936    1930       20
4         Africa  1941    1940       20
8         Europe  1918    1910       20
14          Asia  1827    1820       19
15          Asia  1923    1920       20
...          ...   ...     ...      ...
15685     Europe  1976    1970       20
15689       Asia  1986    1980       20
15698       Asia  1928    1920       20
15710       Asia  1978    1970       20
15711   Americas  1862    1860       19

[2825 rows x 8 columns]
       Income ($)        city               country        sub-region  \
3           11600        Lome                  Togo    Western Africa
16          11600   Mariehamn         Aland Islands   Northern Europe
20          11600    Windhoek               Namibia   Southern Africa
24          11600    San Juan           Puerto Rico         Caribbean
26          11600   New Delhi                 India     Southern Asia
...           ...         ...                   ...               ...
15661       11600      Taipei                Taiwan      Eastern Asia
15663       11600       Alofi                  Niue         Polynesia
15667       11600       Kabul           Afghanistan     Southern Asia
15679       11600   Islamabad              Pakistan     Southern Asia
15682       11600  St. John's   Antigua And Barbuda         Caribbean

          region  year  decade  century
3         Africa  1946    1940       20
16        Europe  1926    1920       20
20        Africa  1867    1860       19
24      Americas  1926    1920       20
26          Asia  1999    1990       20
...          ...   ...     ...      ...
15661       Asia  1988    1980       20
15663    Oceania  1975    1970       20
15667       Asia  1891    1890       19
15679       Asia  1938    1930       20
15682   Americas  1983    1980       20

[1579 rows x 8 columns]
       Income ($)          city       country                  sub-region  \
9           12400    Willemstad       Curaçao                   Caribbean
29          12400    Bratislava      Slovakia              Eastern Europe
37          12400    Phnom Penh      Cambodia          South-Eastern Asia
58          12400      Khartoum         Sudan             Northern Africa
59          12400  Buenos Aires     Argentina               South America
...           ...           ...           ...                         ...
15662       12400       Beijing         China                Eastern Asia
15683       12400      Hamilton       Bermuda            Northern America
15699       12400    Wellington   New Zealand   Australia and New Zealand
15700       12400        Skopje     Macedonia             Southern Europe
15713       12400         Accra         Ghana              Western Africa

          region  year  decade  century
9       Americas  1886    1880       19
29        Europe  1894    1890       19
37          Asia  1900    1890       19
58        Africa  1937    1930       20
59      Americas  1950    1940       20
...          ...   ...     ...      ...
15662       Asia  2011    2010       21
15683   Americas  1984    1980       20
15699    Oceania  1976    1970       20
15700     Europe  1821    1820       19
15713     Africa  1821    1820       19

[1418 rows x 8 columns]
       Income ($)       city         country           sub-region     region  \
44          17200      Tunis         Tunisia      Northern Africa     Africa
51          17200  Ljubljana        Slovenia      Southern Europe     Europe
53          17200   Brasilia          Brazil        South America   Americas
55          17200   Belmopan          Belize      Central America   Americas
70          17200   Brussels         Belgium       Western Europe     Europe
...           ...        ...             ...                  ...        ...
15653       17200    Jakarta       Indonesia   South-Eastern Asia       Asia
15657       17200   Monrovia         Liberia       Western Africa     Africa
15664       17200  Reykjavik         Iceland      Northern Europe     Europe
15696       17200    Cayenne   French Guiana        South America   Americas
15702       17200      Hanoi         Vietnam   South-Eastern Asia       Asia

       year  decade  century
44     1933    1930       20
51     1935    1930       20
53     1930    1920       20
55     1864    1860       19
70     1896    1890       19
...     ...     ...      ...
15653  1971    1970       20
15657  1934    1930       20
15664  1979    1970       20
15696  1899    1890       19
15702  2011    2010       21

[1262 rows x 8 columns]
       Income ($)        city                      country         sub-region  \
0           20900   Port Vila                      Vanuatu          Melanesia
21          20900     Marigot   Saint-Martin (French part)          Caribbean
27          20900      Ottawa                       Canada   Northern America
38          20900  Bridgetown                     Barbados          Caribbean
72          20900     Yaounde                     Cameroon      Middle Africa
...           ...         ...                          ...                ...
15668       20900  The Valley                     Anguilla          Caribbean
15674       20900   N'Djamena                         Chad      Middle Africa
15677       20900      Malabo            Equatorial Guinea      Middle Africa
15693       20900      Tarawa                     Kiribati         Micronesia
15704       20900    Torshavn                Faroe Islands    Northern Europe

          region  year  decade  century
0        Oceania  1930    1920       20
21      Americas  1940    1930       20
27      Americas  1864    1860       19
38      Americas  1937    1930       20
72        Africa  1913    1910       20
...          ...   ...     ...      ...
15668   Americas  1863    1860       19
15674     Africa  1991    1990       20
15677     Africa  1904    1900       20
15693    Oceania  2016    2010       21
15704     Europe  1983    1980       20

[1132 rows x 8 columns]
       Income ($)            city                   country  \
36          22200        Funafuti                    Tuvalu
49          22200      The Valley                  Anguilla
52          22200          Berlin                   Germany
54          22200         Nairobi                     Kenya
62          22200  Fort-de-France                Martinique
...           ...             ...                       ...
15673       22200       New Delhi                     India
15678       22200            Apia                     Samoa
15692       22200         Thimphu                    Bhutan
15703       22200    Port Moresby          Papua new Guinea
15705       22200     West Island   Cocos (Keeling) Islands

                       sub-region     region  year  decade  century
36                      Polynesia    Oceania  1913    1910       20
49                      Caribbean   Americas  1904    1900       20
52                 Western Europe     Europe  1902    1900       20
54                 Eastern Africa     Africa  1918    1910       20
62                      Caribbean   Americas  1895    1890       19
...                           ...        ...   ...     ...      ...
15673               Southern Asia       Asia  1929    1920       20
15678                   Polynesia    Oceania  1847    1840       19
15692               Southern Asia       Asia  1986    1980       20
15703                   Melanesia    Oceania  2014    2010       21
15705   Australia and New Zealand    Oceania  1979    1970       20

[934 rows x 8 columns]
       Income ($)           city                   country  \
7           24100           Juba               South Sudan
17          24100     Nouakchott                Mauritania
151         24100           Riga                    Latvia
174         24100        Bangkok                  Thailand
191         24100         Tarawa                  Kiribati
...           ...            ...                       ...
15606       24100           Bern               Switzerland
15609       24100    West Island   Cocos (Keeling) Islands
15660       24100  Port of Spain       Trinidad And Tobago
15697       24100      Pyongyang               Korea North
15708       24100         Bissau             Guinea-Bissau

                       sub-region     region  year  decade  century
7                   Middle Africa     Africa  1923    1920       20
17                 Western Africa     Africa  1846    1840       19
151               Northern Europe     Europe  1942    1940       20
174            South-Eastern Asia       Asia  1948    1940       20
191                    Micronesia    Oceania  1804    1800       19
...                           ...        ...   ...     ...      ...
15606              Western Europe     Europe  1954    1950       20
15609   Australia and New Zealand    Oceania  1925    1920       20
15660                   Caribbean   Americas  1989    1980       20
15697                Eastern Asia       Asia  1946    1940       20
15708              Western Africa     Africa  1977    1970       20

[656 rows x 8 columns]
       Income ($)         city                     country        sub-region  \
30          25800     Dushanbe                  Tajikistan      Central Asia
35          25800       Moroni                     Comoros    Eastern Africa
68          25800  Philipsburg   Sint Maarten (Dutch part)         Caribbean
90          25800       Berlin                     Germany    Western Europe
225         25800     Budapest                     Hungary    Eastern Europe
...           ...          ...                         ...               ...
15580       25800     Asuncion                    Paraguay     South America
15588       25800     Kingston                     Jamaica         Caribbean
15622       25800      Tallinn                     Estonia   Northern Europe
15637       25800         Rome                       Italy   Southern Europe
15691       25800         Lima                        Peru     South America

          region  year  decade  century
30          Asia  1932    1930       20
35        Africa  1898    1890       19
68      Americas  1823    1820       19
90        Europe  1908    1900       20
225       Europe  1902    1900       20
...          ...   ...     ...      ...
15580   Americas  1973    1970       20
15588   Americas  1809    1800       19
15622     Europe  1949    1940       20
15637     Europe  1885    1880       19
15691   Americas  1905    1900       20

[484 rows x 8 columns]
       Income ($)            city          country  \
5           34400            Juba      South Sudan
6           34400            Lima             Peru
39          34400  Fort-de-France       Martinique
47          34400          Moroni          Comoros
63          34400      Paramaribo         Suriname
...           ...             ...              ...
15376       34400        Kingston   Norfolk Island
15530       34400            Kiev          Ukraine
15651       34400          Lisbon         Portugal
15686       34400     Panama City           Panama
15712       34400          Maseru          Lesotho

                       sub-region     region  year  decade  century
5                   Middle Africa     Africa  1925    1920       20
6                   South America   Americas  1941    1940       20
39                      Caribbean   Americas  1934    1930       20
47                 Eastern Africa     Africa  2010    2000       21
63                  South America   Americas  1915    1910       20
...                           ...        ...   ...     ...      ...
15376   Australia and New Zealand    Oceania  1935    1930       20
15530              Eastern Europe     Europe  1955    1950       20
15651             Southern Europe     Europe  1888    1880       19
15686             Central America   Americas  1947    1940       20
15712             Southern Africa     Africa  1791    1790       18

[302 rows x 8 columns]
       Income ($)         city                     country         sub-region  \
42          34700   Porto-Novo                       Benin     Western Africa
194         34700       Banjul                  Gambia The     Western Africa
273         34700     Tashkent                  Uzbekistan       Central Asia
301         34700        Minsk                     Belarus     Eastern Europe
377         34700     Mata Utu   Wallis And Futuna Islands          Polynesia
...           ...          ...                         ...                ...
15421       34700     Khartoum                       Sudan    Northern Africa
15460       34700   Basseterre       Saint Kitts And Nevis          Caribbean
15523       34700         Nuuk                   Greenland   Northern America
15626       34700       Muscat                        Oman       Western Asia
15709       34700  Tegucigalpa                    Honduras    Central America

          region  year  decade  century
42        Africa  1928    1920       20
194       Africa  1893    1890       19
273         Asia  1938    1930       20
301       Europe  1889    1880       19
377      Oceania  1816    1810       19
...          ...   ...     ...      ...
15421     Africa  1970    1960       20
15460   Americas  1957    1950       20
15523   Americas  1956    1950       20
15626       Asia  1976    1970       20
15709   Americas  1902    1900       20

[174 rows x 8 columns]
       Income ($)              city            country  \
190         38600            Dodoma           Tanzania
215         38600           Bangkok           Thailand
427         38600          Chisinau            Moldova
625         38600  Andorra la Vella            Andorra
707         38600          Santiago              Chile
...           ...               ...                ...
15264       38600              Riga             Latvia
15316       38600          Brasilia             Brazil

In [9]:
datasets[0]

,Income ($),city,country,sub-region,region,year,decade,century
12,3100,Minsk,Belarus,Eastern Europe,Europe,1907,1900,20
61,3100,Astana,Kazakhstan,Central Asia,Asia,1916,1910,20
71,3100,Amman,Jordan,Western Asia,Asia,1945,1940,20
85,3100,Damascus,Syria,Western Asia,Asia,1899,1890,19
111,3100,Nuuk,Greenland,Northern America,Americas,1926,1920,20
...,...,...,...,...,...,...,...,...
15504,3100,Riga,Latvia,Northern Europe,Europe,1858,1850,19
15511,3100,Managua,Nicaragua,Central America,Americas,1946,1940,20
15556,3100,Dhaka,Bangladesh,Southern Asia,Asia,1962,1960,20
15610,3100,Nicosia,Cyprus,Southern Europe,Europe,1858,1850,19
15687,3100,Suva,Fiji Islands,Melanesia,Oceania,1978,1970,20

In [10]:
freq_city = datasets[0]['city'].value_counts()

In [11]:
val_a_sub_city = freq_city[freq_city < 2].index
val_a_sub_city

Index(['Lome', 'Papeete', 'Willemstad', 'Road Town', 'West Island', 'Malabo',
       'Longyearbyen', 'Tehran', 'Paris', 'Thimphu', 'Saipan', 'Pago Pago',
       'Kralendijk', 'Montevideo', 'Nairobi', 'Mbabane', 'Torshavn', 'Harare',
       'Alofi', 'Basse-Terre', 'Bogota', 'Skopje', 'Hagatna', 'Port Vila',
       'Sofia', 'Bujumbura', 'San Juan', 'Madrid', 'St Peter Port', 'Tarawa',
       'Muscat', 'Port-aux-Francais', 'Islamabad', 'Rome', 'Valletta',
       'Kingstown', 'Beirut', 'Phnom Penh', 'Washington', 'Podgorica', 'Tokyo',
       'Dakar', 'Sucre', 'San Jose', 'Juba', 'Oranjestad', 'Guatemala City',
       'Jamestown', 'Flying Fish Cove', 'Majuro', 'Apia', 'Beijing',
       'Mata Utu', 'Ankara', 'Lima', 'Conakry', 'Vatican City'],
      dtype='object')

In [12]:
datasets[0].loc[datasets[0]['city'].isin(val_a_sub_city), 'city'] = '*'
datasets[0]

,Income ($),city,country,sub-region,region,year,decade,century
12,3100,Minsk,Belarus,Eastern Europe,Europe,1907,1900,20
61,3100,Astana,Kazakhstan,Central Asia,Asia,1916,1910,20
71,3100,Amman,Jordan,Western Asia,Asia,1945,1940,20
85,3100,Damascus,Syria,Western Asia,Asia,1899,1890,19
111,3100,Nuuk,Greenland,Northern America,Americas,1926,1920,20
...,...,...,...,...,...,...,...,...
15504,3100,Riga,Latvia,Northern Europe,Europe,1858,1850,19
15511,3100,Managua,Nicaragua,Central America,Americas,1946,1940,20
15556,3100,Dhaka,Bangladesh,Southern Asia,Asia,1962,1960,20
15610,3100,Nicosia,Cyprus,Southern Europe,Europe,1858,1850,19
15687,3100,Suva,Fiji Islands,Melanesia,Oceania,1978,1970,20

In [13]:
datasets[0]['city'].value_counts()

*                 57
Niamey             6
Copenhagen         6
East Jerusalem     6
Seoul              5
                  ..
Praia              2
Amsterdam          2
Kuwait City        2
Budapest           2
San Salvador       2
Name: city, Length: 155, dtype: int64

In [14]:
datasets[0][['city','year']].value_counts()

city           year
*              1942    2
Luanda         1944    2
*              1934    2
               1921    2
               1940    2
                      ..
Cockburn Town  1938    1
               1922    1
               1896    1
               1886    1
Zagreb         1954    1
Length: 485, dtype: int64

In [15]:
freq_year = datasets[0]['year'].value_counts()

In [16]:
val_a_sub_year = freq_year[freq_year < 2].index
val_a_sub_year

Int64Index([1974, 1992, 1997, 1982, 1801, 1910, 1995, 1900, 1823, 1887, 2005,
            1844, 1836, 1892, 1796, 2009, 1831, 1964, 1828, 1839, 1865, 2002,
            1857, 1866, 1874, 1909, 1809, 1916, 1876, 1830, 1841, 1825, 2017,
            1898, 1806, 1879, 1788, 1851, 1798, 1993, 1989, 1868, 1807, 1811,
            1730, 1787, 1848, 1797, 1820, 1800, 2011, 1996, 1804, 1827, 1950],
           dtype='int64')

In [17]:
datasets[0].loc[datasets[0]['year'].isin(val_a_sub_year), 'year'] = '*'
datasets[0]

,Income ($),city,country,sub-region,region,year,decade,century
12,3100,Minsk,Belarus,Eastern Europe,Europe,1907,1900,20
61,3100,Astana,Kazakhstan,Central Asia,Asia,*,1910,20
71,3100,Amman,Jordan,Western Asia,Asia,1945,1940,20
85,3100,Damascus,Syria,Western Asia,Asia,1899,1890,19
111,3100,Nuuk,Greenland,Northern America,Americas,1926,1920,20
...,...,...,...,...,...,...,...,...
15504,3100,Riga,Latvia,Northern Europe,Europe,1858,1850,19
15511,3100,Managua,Nicaragua,Central America,Americas,1946,1940,20
15556,3100,Dhaka,Bangladesh,Southern Asia,Asia,1962,1960,20
15610,3100,Nicosia,Cyprus,Southern Europe,Europe,1858,1850,19
15687,3100,Suva,Fiji Islands,Melanesia,Oceania,1978,1970,20

In [18]:
datasets[0]['year'].value_counts()

*       55
1944    10
1946     9
1928     9
1947     8
        ..
1917     2
1886     2
1872     2
1958     2
1955     2
Name: year, Length: 114, dtype: int64

In [19]:
datasets[0][['city','year']].value_counts()

city        year
*           *       7
Luanda      1944    2
*           1921    2
Dodoma      *       2
*           1952    2
                   ..
Copenhagen  1912    1
            1867    1
Colombo     *       1
            2006    1
Zagreb      1954    1
Length: 476, dtype: int64

freq_city_year = datasets[0]['city-year'].value_counts()
freq_city_year

datasets[0]['city-year'] = datasets[0]['city'] + '-' + datasets[0]['year'].astype(str)
datasets[0]

val_a_sub_city_year = freq_city_year[freq_city_year < 2].index
val_a_sub_city_year

datasets[0].loc[datasets[0]['city-year'].isin(val_a_sub_city_year), 'city'] = '*'
datasets[0].loc[datasets[0]['city-year'].isin(val_a_sub_city_year), 'year'] = '*'
datasets[0]

datasets[0].drop(['city-year'], axis=1, inplace=True)
datasets[0]